# frozen_string_literal: true

class WeatherController < ApplicationController
  def index
    region_code = params[:region_code].presence || '130000'

    coordinates_map = {
      '011000' => { lat: 45.414505, lon: 141.673762 }, # 宗谷地方
      '012000' => { lat: 43.770634, lon: 142.364819 }, # 上川・留萌地方
      '016000' => { lat: 43.062095, lon: 141.354376 }, # 石狩・空知・後志地方
      '013000' => { lat: 43.803764, lon: 144.083482 }, # 網走・北見・紋別地方
      '014100' => { lat: 42.984854, lon: 144.381697 }, # 釧路・根室地方
      '015000' => { lat: 42.624682, lon: 141.614500 }, # 胆振・日高地方
      '017000' => { lat: 41.806648, lon: 140.749917 }, # 渡島・檜山地方
      '020000' => { lat: 40.824623, lon: 140.740593 }, # 青森県
      '050000' => { lat: 39.718559, lon: 140.102347 }, # 秋田県
      '030000' => { lat: 39.703531, lon: 141.152667 }, # 岩手県
      '040000' => { lat: 38.268837, lon: 140.872103 }, # 宮城県
      '060000' => { lat: 38.240436, lon: 140.363634 }, # 山形県
      '070000' => { lat: 37.750298, lon: 140.467552 }, # 福島県
      '080000' => { lat: 36.341811, lon: 140.446793 }, # 茨城県
      '090000' => { lat: 36.565725, lon: 139.883565 }, # 栃木県
      '100000' => { lat: 36.391217, lon: 139.060905 }, # 群馬県
      '110000' => { lat: 35.857428, lon: 139.648911 }, # 埼玉県
      '130000' => { lat: 35.689487, lon: 139.691711 }, # 東京都
      '120000' => { lat: 35.605058, lon: 140.123308 }, # 千葉県
      '140000' => { lat: 35.447538, lon: 139.642348 }, # 神奈川県
      '200000' => { lat: 36.651289, lon: 138.181224 }, # 長野県
      '190000' => { lat: 35.664158, lon: 138.568449 }, # 山梨県
      '220000' => { lat: 34.97712, lon: 138.383083 },  # 静岡県
      '230000' => { lat: 35.180188, lon: 136.906565 }, # 愛知県
      '210000' => { lat: 35.423298, lon: 136.760654 }, # 岐阜県
      '240000' => { lat: 34.730283, lon: 136.508598 }, # 三重県
      '150000' => { lat: 37.902824, lon: 139.023222 }, # 新潟県
      '160000' => { lat: 36.695951, lon: 137.213676 }, # 富山県
      '170000' => { lat: 36.594682, lon: 136.625573 }, # 石川県
      '180000' => { lat: 36.065219, lon: 136.221643 }, # 福井県
      '250000' => { lat: 35.004528, lon: 135.868607 }, # 滋賀県
      '260000' => { lat: 35.021247, lon: 135.755596 }, # 京都府
      '270000' => { lat: 34.693738, lon: 135.502165 }, # 大阪府
      '280000' => { lat: 34.691286, lon: 135.183025 }, # 兵庫県
      '290000' => { lat: 34.685325, lon: 135.832746 }, # 奈良県
      '300000' => { lat: 34.226034, lon: 135.167506 }, # 和歌山県
      '330000' => { lat: 34.665267, lon: 133.933535 }, # 岡山県
      '340000' => { lat: 34.396560, lon: 132.459622 }, # 広島県
      '320000' => { lat: 35.472297, lon: 133.050499 }, # 島根県
      '310000' => { lat: 35.503867, lon: 134.237673 }, # 鳥取県
      '360000' => { lat: 34.06576, lon: 134.559329 },  # 徳島県
      '370000' => { lat: 34.340149, lon: 134.043444 }, # 香川県
      '380000' => { lat: 33.841622, lon: 132.765681 }, # 愛媛県
      '390000' => { lat: 33.559702, lon: 133.531118 }, # 高知県
      '350000' => { lat: 34.186121, lon: 131.470494 }, # 山口県
      '400000' => { lat: 33.590355, lon: 130.401716 }, # 福岡県
      '440000' => { lat: 33.2325, lon: 131.612667 },   # 大分県
      '420000' => { lat: 32.750286, lon: 129.877667 }, # 長崎県
      '410000' => { lat: 33.263482, lon: 130.300857 }, # 佐賀県
      '430000' => { lat: 32.8031, lon: 130.707891 },   # 熊本県
      '450000' => { lat: 31.907722, lon: 131.420241 }, # 宮崎県
      '460100' => { lat: 31.560148, lon: 130.557981 }, # 鹿児島県
      '471000' => { lat: 26.212312, lon: 127.679156 }, # 沖縄本島地方
      '472000' => { lat: 25.828628, lon: 131.231333 }, # 大東島地方
      '473000' => { lat: 24.805284, lon: 125.281698 }, # 宮古島地方
      '474000' => { lat: 24.340145, lon: 124.155682 }  # 八重山地方
    }

    # マップで存在しなければデフォルトは東京にする
    coords = coordinates_map[region_code] || coordinates_map['130000']
    latitude = coords[:lat]
    longitude = coords[:lon]

    # 複数日、複数ソースを統合した予報データを取得
    # @forecasts: [{date: '2024-12-18', average: X, max: Y, min:Z, source_count: N}, ...]
    @forecasts = WeatherService.fetch_multi_day_combined_forecasts(region_code, latitude, longitude)

    # 当日分（1日目）のデータを使って@average_precipitationなどを表示したい場合は、
    today_forecast = @forecasts.find { |f| f[:date] == Date.today.to_s }
    if today_forecast
      @average_precipitation = today_forecast[:average]
      @max_precipitation = today_forecast[:max]
      @min_precipitation = today_forecast[:min]
    else
      @average_precipitation = nil
      @max_precipitation = nil
      @min_precipitation = nil
    end
  end
end
